package Lesson5Functions;

public class App1 {

    public static void main(String[] args) {
        hey();
    }
    public static void hey(){
        System.out.println("Hey-Hey");
        System.out.println("Nice to meet you");  /// If you run the function it wouldn't print
    }
}
// мы можем функцию вызвать только изнутри другой функции.
//что такое внутрь функции?
//  открывающие и закрывающие коли brace. и фигурные скобки.
//  это тело функции.
//  "мы можем вызвать одну функцию только в теле другой функции"
//  это general idea.
//  мы можем функцию вызвать из функции только.
//
//  окей пока я функцию не вызвал она
//не работает функция main она особо и вообще любая программа в
//любом языке программирования она начинается с функцией main и заканчивается функции main как только мы
//закончили программу это значит функция main закончилось.

//если скобки значит это функция

